[Killed] BlockStatement
lib/grading/deterministic.ts:44:28
   submitted: unknown,
   correct: string,
   maxPoints = 1
-): DeterministicItemResult {
-  const normItemId = normalizeId(itemId);
-  const normSubmitted = normalizeString(submitted);
-  const normCorrect = normalizeString(correct);
-
-  if (!normSubmitted) {
-    return {
-      itemId: normItemId,
-      status: "unanswered",
-      pointsEarned: 0,
-      maxPoints,
-    };
-  }
-
-  const isCorrect = normSubmitted.toLowerCase() === normCorrect.toLowerCase();
-
-  return {
-    itemId: normItemId,
-    status: isCorrect ? "correct" : "incorrect",
-    pointsEarned: isCorrect ? maxPoints : 0,
-    maxPoints,
-    submittedAnswer: normSubmitted,
-  };
-}
+): DeterministicItemResult {}
 
 /**
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:49:7
   const normSubmitted = normalizeString(submitted);
   const normCorrect = normalizeString(correct);
 
-  if (!normSubmitted) {
+  if (false) {
     return {
       itemId: normItemId,
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:49:23
   const normSubmitted = normalizeString(submitted);
   const normCorrect = normalizeString(correct);
 
-  if (!normSubmitted) {
-    return {
-      itemId: normItemId,
-      status: "unanswered",
-      pointsEarned: 0,
-      maxPoints,
-    };
-  }
+  if (!normSubmitted) {}
 
   const isCorrect = normSubmitted.toLowerCase() === normCorrect.toLowerCase();
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] MethodExpression
lib/grading/deterministic.ts:58:21
     };
   }
 
-  const isCorrect = normSubmitted.toLowerCase() === normCorrect.toLowerCase();
+  const isCorrect = normSubmitted.toUpperCase() === normCorrect.toLowerCase();
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] MethodExpression
lib/grading/deterministic.ts:58:53
     };
   }
 
-  const isCorrect = normSubmitted.toLowerCase() === normCorrect.toLowerCase();
+  const isCorrect = normSubmitted.toLowerCase() === normCorrect.toUpperCase();
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ObjectLiteral
lib/grading/deterministic.ts:60:10
 
   const isCorrect = normSubmitted.toLowerCase() === normCorrect.toLowerCase();
 
-  return {
-    itemId: normItemId,
-    status: isCorrect ? "correct" : "incorrect",
-    pointsEarned: isCorrect ? maxPoints : 0,
-    maxPoints,
-    submittedAnswer: normSubmitted,
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:83:7
   const normCorrect = normalizeStringArray(correctOrder);
   const maxPoints = normCorrect.length;
 
-  if (normSubmitted.length === 0) {
+  if (false) {
     return {
       itemId: normStoryId,
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:83:7
   const normCorrect = normalizeStringArray(correctOrder);
   const maxPoints = normCorrect.length;
 
-  if (normSubmitted.length === 0) {
+  if (true) {
     return {
       itemId: normStoryId,
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:93:19
   }
 
   let pointsEarned = 0;
-  for (let i = 0; i < normCorrect.length; i++) {
+  for (let i = 0; i >= normCorrect.length; i++) {
     if (i < normSubmitted.length && normSubmitted[i] === normCorrect[i]) {
       pointsEarned += 1;
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:93:48
   }
 
   let pointsEarned = 0;
-  for (let i = 0; i < normCorrect.length; i++) {
-    if (i < normSubmitted.length && normSubmitted[i] === normCorrect[i]) {
-      pointsEarned += 1;
-    }
-  }
+  for (let i = 0; i < normCorrect.length; i++) {}
 
   const status: ItemGradingStatus = pointsEarned === maxPoints ? "correct" : "incorrect";
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:94:9
 
   let pointsEarned = 0;
   for (let i = 0; i < normCorrect.length; i++) {
-    if (i < normSubmitted.length && normSubmitted[i] === normCorrect[i]) {
+    if (false) {
       pointsEarned += 1;
     }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:94:37
 
   let pointsEarned = 0;
   for (let i = 0; i < normCorrect.length; i++) {
-    if (i < normSubmitted.length && normSubmitted[i] === normCorrect[i]) {
+    if (i < normSubmitted.length && true) {
       pointsEarned += 1;
     }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] AssignmentOperator
lib/grading/deterministic.ts:95:7
   let pointsEarned = 0;
   for (let i = 0; i < normCorrect.length; i++) {
     if (i < normSubmitted.length && normSubmitted[i] === normCorrect[i]) {
-      pointsEarned += 1;
+      pointsEarned -= 1;
     }
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:99:37
     }
   }
 
-  const status: ItemGradingStatus = pointsEarned === maxPoints ? "correct" : "incorrect";
+  const status: ItemGradingStatus = false ? "correct" : "incorrect";
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:99:37
     }
   }
 
-  const status: ItemGradingStatus = pointsEarned === maxPoints ? "correct" : "incorrect";
+  const status: ItemGradingStatus = pointsEarned !== maxPoints ? "correct" : "incorrect";
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:123:29
   let rawScore = 0;
   let maxRawScore = 0;
 
-  for (const item of items) {
-    maxRawScore += item.maxPoints;
-    rawScore += item.pointsEarned;
-    if (item.status !== "unanswered") {
-      answeredItems += 1;
-    }
-    if (item.status === "correct") {
-      correctItems += 1;
-    }
-  }
+  for (const item of items) {}
 
   const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] AssignmentOperator
lib/grading/deterministic.ts:124:5
   let maxRawScore = 0;
 
   for (const item of items) {
-    maxRawScore += item.maxPoints;
+    maxRawScore -= item.maxPoints;
     rawScore += item.pointsEarned;
     if (item.status !== "unanswered") {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] AssignmentOperator
lib/grading/deterministic.ts:125:5
 
   for (const item of items) {
     maxRawScore += item.maxPoints;
-    rawScore += item.pointsEarned;
+    rawScore -= item.pointsEarned;
     if (item.status !== "unanswered") {
       answeredItems += 1;
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:126:9
   for (const item of items) {
     maxRawScore += item.maxPoints;
     rawScore += item.pointsEarned;
-    if (item.status !== "unanswered") {
+    if (false) {
       answeredItems += 1;
     }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] ConditionalExpression
lib/grading/deterministic.ts:126:9
   for (const item of items) {
     maxRawScore += item.maxPoints;
     rawScore += item.pointsEarned;
-    if (item.status !== "unanswered") {
+    if (true) {
       answeredItems += 1;
     }

[Survived] AssignmentOperator
lib/grading/deterministic.ts:127:7
     maxRawScore += item.maxPoints;
     rawScore += item.pointsEarned;
     if (item.status !== "unanswered") {
-      answeredItems += 1;
+      answeredItems -= 1;
     }
     if (item.status === "correct") {

[Killed] ConditionalExpression
lib/grading/deterministic.ts:129:9
     if (item.status !== "unanswered") {
       answeredItems += 1;
     }
-    if (item.status === "correct") {
+    if (false) {
       correctItems += 1;
     }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:129:36
     if (item.status !== "unanswered") {
       answeredItems += 1;
     }
-    if (item.status === "correct") {
-      correctItems += 1;
-    }
+    if (item.status === "correct") {}
   }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] AssignmentOperator
lib/grading/deterministic.ts:130:7
       answeredItems += 1;
     }
     if (item.status === "correct") {
-      correctItems += 1;
+      correctItems -= 1;
     }
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:134:41
     }
   }
 
-  const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
+  const percentage = maxRawScore > 0 ? (rawScore * maxRawScore) * 100 : 0;
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:134:40
     }
   }
 
-  const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
+  const percentage = maxRawScore > 0 ? rawScore / maxRawScore / 100 : 0;
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ObjectLiteral
lib/grading/deterministic.ts:136:10
 
   const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
 
-  return {
-    partIdentifier,
-    totalItems,
-    answeredItems,
-    correctItems,
-    rawScore,
-    maxRawScore,
-    percentage,
-    items,
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:155:28
 export function gradeGrammarPart(
   submission: GrammarSubmission = {},
   expectedAnswers: Record<string, string>
-): DeterministicPartResult {
-  const expectedKeys = Object.keys(expectedAnswers);
-  if (expectedKeys.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Grammar answer key is empty");
-  }
-
-  const items: DeterministicItemResult[] = [];
-  for (const qId of expectedKeys) {
-    const correct = expectedAnswers[qId];
-    const userAns = submission[qId];
-    items.push(gradeSingleChoiceItem(qId, userAns, correct, 1));
-  }
-
-  return aggregatePartResult("grammar", items);
-}
+): DeterministicPartResult {}
 
 export function gradeVocabularyPart(
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:157:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const expectedKeys = Object.keys(expectedAnswers);
-  if (expectedKeys.length === 0) {
+  if (true) {
     throw createGradingError("MISSING_ANSWER_KEY", "Grammar answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:157:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const expectedKeys = Object.keys(expectedAnswers);
-  if (expectedKeys.length === 0) {
+  if (expectedKeys.length !== 0) {
     throw createGradingError("MISSING_ANSWER_KEY", "Grammar answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:162:35
   }
 
   const items: DeterministicItemResult[] = [];
-  for (const qId of expectedKeys) {
-    const correct = expectedAnswers[qId];
-    const userAns = submission[qId];
-    items.push(gradeSingleChoiceItem(qId, userAns, correct, 1));
-  }
+  for (const qId of expectedKeys) {}
 
   return aggregatePartResult("grammar", items);
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] CallExpression
lib/grading/deterministic.ts:165:5
   for (const qId of expectedKeys) {
     const correct = expectedAnswers[qId];
     const userAns = submission[qId];
-    items.push(gradeSingleChoiceItem(qId, userAns, correct, 1));
+    ;
   }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] StringLiteral
lib/grading/deterministic.ts:168:30
     items.push(gradeSingleChoiceItem(qId, userAns, correct, 1));
   }
 
-  return aggregatePartResult("grammar", items);
+  return aggregatePartResult("", items);
 }
 

[Killed] BlockStatement
lib/grading/deterministic.ts:174:28
 export function gradeVocabularyPart(
   submission: VocabularySubmission = {},
   expectedAnswers: Record<string, string>
-): DeterministicPartResult {
-  const expectedKeys = Object.keys(expectedAnswers);
-  if (expectedKeys.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Vocabulary answer key is empty");
-  }
-
-  const items: DeterministicItemResult[] = [];
-  for (const itemId of expectedKeys) {
-    const correct = expectedAnswers[itemId];
-    const userAns = submission[itemId];
-    items.push(gradeSingleChoiceItem(itemId, userAns, correct, 1));
-  }
-
-  return aggregatePartResult("vocabulary", items);
-}
+): DeterministicPartResult {}
 
 export function gradeGrammarVocabularySection(
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] StringLiteral
lib/grading/deterministic.ts:177:52
 ): DeterministicPartResult {
   const expectedKeys = Object.keys(expectedAnswers);
   if (expectedKeys.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Vocabulary answer key is empty");
+    throw createGradingError("MISSING_ANSWER_KEY", "");
   }
 

[Killed] BlockStatement
lib/grading/deterministic.ts:181:38
   }
 
   const items: DeterministicItemResult[] = [];
-  for (const itemId of expectedKeys) {
-    const correct = expectedAnswers[itemId];
-    const userAns = submission[itemId];
-    items.push(gradeSingleChoiceItem(itemId, userAns, correct, 1));
-  }
+  for (const itemId of expectedKeys) {}
 
   return aggregatePartResult("vocabulary", items);
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] CallExpression
lib/grading/deterministic.ts:184:5
   for (const itemId of expectedKeys) {
     const correct = expectedAnswers[itemId];
     const userAns = submission[itemId];
-    items.push(gradeSingleChoiceItem(itemId, userAns, correct, 1));
+    ;
   }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:193:31
 export function gradeGrammarVocabularySection(
   submission: GrammarVocabularySubmission = {},
   answerKey: ServerAnswerKey["grammarVocabulary"]
-): DeterministicSectionResult {
-  const grammarPart = gradeGrammarPart(submission.grammar, answerKey.grammarAnswers);
-  const vocabPart = gradeVocabularyPart(submission.vocabulary, answerKey.vocabularyAnswers);
-
-  const rawScore = grammarPart.rawScore + vocabPart.rawScore;
-  const maxRawScore = grammarPart.maxRawScore + vocabPart.maxRawScore;
-  const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
-
-  return {
-    sectionName: "grammarVocabulary",
-    rawScore,
-    maxRawScore,
-    percentage,
-    parts: {
-      grammar: grammarPart,
-      vocabulary: vocabPart,
-    },
-  };
-}
+): DeterministicSectionResult {}
 
 // ==========================================
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:197:20
   const grammarPart = gradeGrammarPart(submission.grammar, answerKey.grammarAnswers);
   const vocabPart = gradeVocabularyPart(submission.vocabulary, answerKey.vocabularyAnswers);
 
-  const rawScore = grammarPart.rawScore + vocabPart.rawScore;
+  const rawScore = grammarPart.rawScore - vocabPart.rawScore;
   const maxRawScore = grammarPart.maxRawScore + vocabPart.maxRawScore;
   const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:198:23
   const vocabPart = gradeVocabularyPart(submission.vocabulary, answerKey.vocabularyAnswers);
 
   const rawScore = grammarPart.rawScore + vocabPart.rawScore;
-  const maxRawScore = grammarPart.maxRawScore + vocabPart.maxRawScore;
+  const maxRawScore = grammarPart.maxRawScore - vocabPart.maxRawScore;
   const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:199:22
 
   const rawScore = grammarPart.rawScore + vocabPart.rawScore;
   const maxRawScore = grammarPart.maxRawScore + vocabPart.maxRawScore;
-  const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
+  const percentage = false ? (rawScore / maxRawScore) * 100 : 0;
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:199:40
 
   const rawScore = grammarPart.rawScore + vocabPart.rawScore;
   const maxRawScore = grammarPart.maxRawScore + vocabPart.maxRawScore;
-  const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
+  const percentage = maxRawScore > 0 ? rawScore / maxRawScore / 100 : 0;
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:220:28
 export function gradeReadingPart1(
   submission: ReadingPart1Submission = {},
   expectedAnswers: Record<string, string>
-): DeterministicPartResult {
-  const expectedKeys = Object.keys(expectedAnswers);
-  if (expectedKeys.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 1 answer key is empty");
-  }
-
-  const items = expectedKeys.map((gapId) =>
-    gradeSingleChoiceItem(gapId, submission[gapId], expectedAnswers[gapId], 1)
-  );
-
-  return aggregatePartResult("reading_part1", items);
-}
+): DeterministicPartResult {}
 
 export function gradeReadingPart2(
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArrowFunction
lib/grading/deterministic.ts:226:34
     throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 1 answer key is empty");
   }
 
-  const items = expectedKeys.map((gapId) =>
-    gradeSingleChoiceItem(gapId, submission[gapId], expectedAnswers[gapId], 1)
+  const items = expectedKeys.map(() => undefined
   );
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:236:28
 export function gradeReadingPart2(
   submission: ReadingPart2Submission = {},
   expectedAnswers: Record<string, string[]>
-): DeterministicPartResult {
-  const storyIds = Object.keys(expectedAnswers);
-  if (storyIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 2 answer key is empty");
-  }
-
-  const items = storyIds.map((sId) =>
-    gradeOrderingStory(sId, submission[sId], expectedAnswers[sId])
-  );
-
-  return aggregatePartResult("reading_part2", items);
-}
+): DeterministicPartResult {}
 
 export function gradeReadingPart3(
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:238:7
   expectedAnswers: Record<string, string[]>
 ): DeterministicPartResult {
   const storyIds = Object.keys(expectedAnswers);
-  if (storyIds.length === 0) {
+  if (storyIds.length !== 0) {
     throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 2 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:238:7
   expectedAnswers: Record<string, string[]>
 ): DeterministicPartResult {
   const storyIds = Object.keys(expectedAnswers);
-  if (storyIds.length === 0) {
+  if (true) {
     throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 2 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArrowFunction
lib/grading/deterministic.ts:242:30
     throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 2 answer key is empty");
   }
 
-  const items = storyIds.map((sId) =>
-    gradeOrderingStory(sId, submission[sId], expectedAnswers[sId])
+  const items = storyIds.map(() => undefined
   );
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:252:28
 export function gradeReadingPart3(
   submission: ReadingPart3Submission = {},
   expectedAnswers: Record<string, string>
-): DeterministicPartResult {
-  const statementIds = Object.keys(expectedAnswers);
-  if (statementIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 3 answer key is empty");
-  }
-
-  const items = statementIds.map((sId) =>
-    gradeSingleChoiceItem(sId, submission[sId], expectedAnswers[sId], 1)
-  );
-
-  return aggregatePartResult("reading_part3", items);
-}
+): DeterministicPartResult {}
 
 export function gradeReadingPart4(
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:254:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const statementIds = Object.keys(expectedAnswers);
-  if (statementIds.length === 0) {
+  if (statementIds.length !== 0) {
     throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 3 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...
