[Killed] ConditionalExpression
lib/grading/deterministic.ts:254:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const statementIds = Object.keys(expectedAnswers);
-  if (statementIds.length === 0) {
+  if (true) {
     throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 3 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] StringLiteral
lib/grading/deterministic.ts:255:52
 ): DeterministicPartResult {
   const statementIds = Object.keys(expectedAnswers);
   if (statementIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 3 answer key is empty");
+    throw createGradingError("MISSING_ANSWER_KEY", "");
   }
 

[Killed] ArrowFunction
lib/grading/deterministic.ts:258:34
     throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 3 answer key is empty");
   }
 
-  const items = statementIds.map((sId) =>
-    gradeSingleChoiceItem(sId, submission[sId], expectedAnswers[sId], 1)
+  const items = statementIds.map(() => undefined
   );
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] StringLiteral
lib/grading/deterministic.ts:262:30
     gradeSingleChoiceItem(sId, submission[sId], expectedAnswers[sId], 1)
   );
 
-  return aggregatePartResult("reading_part3", items);
+  return aggregatePartResult("", items);
 }
 

[Killed] BlockStatement
lib/grading/deterministic.ts:268:28
 export function gradeReadingPart4(
   submission: ReadingPart4Submission = {},
   expectedAnswers: Record<string, string>
-): DeterministicPartResult {
-  const paragraphIds = Object.keys(expectedAnswers);
-  if (paragraphIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 4 answer key is empty");
-  }
-
-  const items = paragraphIds.map((pId) =>
-    gradeSingleChoiceItem(pId, submission[pId], expectedAnswers[pId], 1)
-  );
-
-  return aggregatePartResult("reading_part4", items);
-}
+): DeterministicPartResult {}
 
 export function gradeReadingSection(
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:270:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const paragraphIds = Object.keys(expectedAnswers);
-  if (paragraphIds.length === 0) {
+  if (paragraphIds.length !== 0) {
     throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 4 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:270:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const paragraphIds = Object.keys(expectedAnswers);
-  if (paragraphIds.length === 0) {
+  if (true) {
     throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 4 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] StringLiteral
lib/grading/deterministic.ts:271:52
 ): DeterministicPartResult {
   const paragraphIds = Object.keys(expectedAnswers);
   if (paragraphIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 4 answer key is empty");
+    throw createGradingError("MISSING_ANSWER_KEY", "");
   }
 

[Killed] ArrowFunction
lib/grading/deterministic.ts:274:34
     throw createGradingError("MISSING_ANSWER_KEY", "Reading Part 4 answer key is empty");
   }
 
-  const items = paragraphIds.map((pId) =>
-    gradeSingleChoiceItem(pId, submission[pId], expectedAnswers[pId], 1)
+  const items = paragraphIds.map(() => undefined
   );
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:284:31
 export function gradeReadingSection(
   submission: ReadingSubmission = {},
   answerKey: ServerAnswerKey["reading"]
-): DeterministicSectionResult {
-  const part1 = gradeReadingPart1(submission.part1, answerKey.part1);
-  const part2 = gradeReadingPart2(submission.part2, answerKey.part2);
-  const part3 = gradeReadingPart3(submission.part3, answerKey.part3);
-  const part4 = gradeReadingPart4(submission.part4, answerKey.part4);
-
-  const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
-  const maxRawScore =
-    part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
-  const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
-
-  return {
-    sectionName: "reading",
-    rawScore,
-    maxRawScore,
-    percentage,
-    parts: {
-      part1,
-      part2,
-      part3,
-      part4,
-    },
-  };
-}
+): DeterministicSectionResult {}
 
 // ==========================================
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:290:20
   const part3 = gradeReadingPart3(submission.part3, answerKey.part3);
   const part4 = gradeReadingPart4(submission.part4, answerKey.part4);
 
-  const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
+  const rawScore = part1.rawScore + part2.rawScore + part3.rawScore - part4.rawScore;
   const maxRawScore =
     part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:290:20
   const part3 = gradeReadingPart3(submission.part3, answerKey.part3);
   const part4 = gradeReadingPart4(submission.part4, answerKey.part4);
 
-  const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
+  const rawScore = part1.rawScore + part2.rawScore - part3.rawScore + part4.rawScore;
   const maxRawScore =
     part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:292:5
 
   const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
   const maxRawScore =
-    part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
+    part1.maxRawScore - part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
   const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:292:5
 
   const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
   const maxRawScore =
-    part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
+    part1.maxRawScore + part2.maxRawScore + part3.maxRawScore - part4.maxRawScore;
   const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:293:22
   const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
   const maxRawScore =
     part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
-  const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
+  const percentage = maxRawScore <= 0 ? (rawScore / maxRawScore) * 100 : 0;
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:293:41
   const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
   const maxRawScore =
     part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
-  const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
+  const percentage = maxRawScore > 0 ? (rawScore * maxRawScore) * 100 : 0;
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:316:28
 export function gradeListeningPart1(
   submission: ListeningPart1Submission = {},
   expectedAnswers: Record<string, string>
-): DeterministicPartResult {
-  const taskIds = Object.keys(expectedAnswers);
-  if (taskIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 1 answer key is empty");
-  }
-
-  const items = taskIds.map((tId) =>
-    gradeSingleChoiceItem(tId, submission[tId], expectedAnswers[tId], 1)
-  );
-
-  return aggregatePartResult("listening_part1", items);
-}
+): DeterministicPartResult {}
 
 export function gradeListeningPart2(
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:318:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const taskIds = Object.keys(expectedAnswers);
-  if (taskIds.length === 0) {
+  if (taskIds.length !== 0) {
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 1 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:318:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const taskIds = Object.keys(expectedAnswers);
-  if (taskIds.length === 0) {
+  if (true) {
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 1 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArrowFunction
lib/grading/deterministic.ts:322:29
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 1 answer key is empty");
   }
 
-  const items = taskIds.map((tId) =>
-    gradeSingleChoiceItem(tId, submission[tId], expectedAnswers[tId], 1)
+  const items = taskIds.map(() => undefined
   );
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:332:28
 export function gradeListeningPart2(
   submission: ListeningPart2Submission = {},
   expectedAnswers: Record<string, string>
-): DeterministicPartResult {
-  const speakerIds = Object.keys(expectedAnswers);
-  if (speakerIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 2 answer key is empty");
-  }
-
-  const items = speakerIds.map((sId) =>
-    gradeSingleChoiceItem(sId, submission[sId], expectedAnswers[sId], 1)
-  );
-
-  return aggregatePartResult("listening_part2", items);
-}
+): DeterministicPartResult {}
 
 export function gradeListeningPart3(
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:334:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const speakerIds = Object.keys(expectedAnswers);
-  if (speakerIds.length === 0) {
+  if (speakerIds.length !== 0) {
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 2 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:334:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const speakerIds = Object.keys(expectedAnswers);
-  if (speakerIds.length === 0) {
+  if (true) {
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 2 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] StringLiteral
lib/grading/deterministic.ts:335:52
 ): DeterministicPartResult {
   const speakerIds = Object.keys(expectedAnswers);
   if (speakerIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 2 answer key is empty");
+    throw createGradingError("MISSING_ANSWER_KEY", "");
   }
 

[Killed] ArrowFunction
lib/grading/deterministic.ts:338:32
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 2 answer key is empty");
   }
 
-  const items = speakerIds.map((sId) =>
-    gradeSingleChoiceItem(sId, submission[sId], expectedAnswers[sId], 1)
+  const items = speakerIds.map(() => undefined
   );
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:348:28
 export function gradeListeningPart3(
   submission: ListeningPart3Submission = {},
   expectedAnswers: Record<string, string>
-): DeterministicPartResult {
-  const stmtIds = Object.keys(expectedAnswers);
-  if (stmtIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 3 answer key is empty");
-  }
-
-  const items = stmtIds.map((sId) =>
-    gradeSingleChoiceItem(sId, submission[sId], expectedAnswers[sId], 1)
-  );
-
-  return aggregatePartResult("listening_part3", items);
-}
+): DeterministicPartResult {}
 
 export function gradeListeningPart4(
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:350:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const stmtIds = Object.keys(expectedAnswers);
-  if (stmtIds.length === 0) {
+  if (stmtIds.length !== 0) {
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 3 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:350:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const stmtIds = Object.keys(expectedAnswers);
-  if (stmtIds.length === 0) {
+  if (true) {
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 3 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArrowFunction
lib/grading/deterministic.ts:354:29
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 3 answer key is empty");
   }
 
-  const items = stmtIds.map((sId) =>
-    gradeSingleChoiceItem(sId, submission[sId], expectedAnswers[sId], 1)
+  const items = stmtIds.map(() => undefined
   );
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] StringLiteral
lib/grading/deterministic.ts:358:30
     gradeSingleChoiceItem(sId, submission[sId], expectedAnswers[sId], 1)
   );
 
-  return aggregatePartResult("listening_part3", items);
+  return aggregatePartResult("", items);
 }
 

[Killed] BlockStatement
lib/grading/deterministic.ts:364:28
 export function gradeListeningPart4(
   submission: ListeningPart4Submission = {},
   expectedAnswers: Record<string, string>
-): DeterministicPartResult {
-  const questionIds = Object.keys(expectedAnswers);
-  if (questionIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 4 answer key is empty");
-  }
-
-  const items = questionIds.map((qId) =>
-    gradeSingleChoiceItem(qId, submission[qId], expectedAnswers[qId], 1)
-  );
-
-  return aggregatePartResult("listening_part4", items);
-}
+): DeterministicPartResult {}
 
 export function gradeListeningSection(
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:366:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const questionIds = Object.keys(expectedAnswers);
-  if (questionIds.length === 0) {
+  if (true) {
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 4 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:366:7
   expectedAnswers: Record<string, string>
 ): DeterministicPartResult {
   const questionIds = Object.keys(expectedAnswers);
-  if (questionIds.length === 0) {
+  if (questionIds.length !== 0) {
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 4 answer key is empty");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] StringLiteral
lib/grading/deterministic.ts:367:30
 ): DeterministicPartResult {
   const questionIds = Object.keys(expectedAnswers);
   if (questionIds.length === 0) {
-    throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 4 answer key is empty");
+    throw createGradingError("", "Listening Part 4 answer key is empty");
   }
 

[Killed] ArrowFunction
lib/grading/deterministic.ts:370:33
     throw createGradingError("MISSING_ANSWER_KEY", "Listening Part 4 answer key is empty");
   }
 
-  const items = questionIds.map((qId) =>
-    gradeSingleChoiceItem(qId, submission[qId], expectedAnswers[qId], 1)
+  const items = questionIds.map(() => undefined
   );
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] StringLiteral
lib/grading/deterministic.ts:374:30
     gradeSingleChoiceItem(qId, submission[qId], expectedAnswers[qId], 1)
   );
 
-  return aggregatePartResult("listening_part4", items);
+  return aggregatePartResult("", items);
 }
 

[Killed] BlockStatement
lib/grading/deterministic.ts:380:31
 export function gradeListeningSection(
   submission: ListeningSubmission = {},
   answerKey: ServerAnswerKey["listening"]
-): DeterministicSectionResult {
-  const part1 = gradeListeningPart1(submission.part1, answerKey.part1);
-  const part2 = gradeListeningPart2(submission.part2, answerKey.part2);
-  const part3 = gradeListeningPart3(submission.part3, answerKey.part3);
-  const part4 = gradeListeningPart4(submission.part4, answerKey.part4);
-
-  const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
-  const maxRawScore =
-    part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
-  const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
-
-  return {
-    sectionName: "listening",
-    rawScore,
-    maxRawScore,
-    percentage,
-    parts: {
-      part1,
-      part2,
-      part3,
-      part4,
-    },
-  };
-}
+): DeterministicSectionResult {}
 
 // ==========================================
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:386:20
   const part3 = gradeListeningPart3(submission.part3, answerKey.part3);
   const part4 = gradeListeningPart4(submission.part4, answerKey.part4);
 
-  const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
+  const rawScore = part1.rawScore - part2.rawScore + part3.rawScore + part4.rawScore;
   const maxRawScore =
     part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArithmeticOperator
lib/grading/deterministic.ts:388:5
 
   const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
   const maxRawScore =
-    part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
+    part1.maxRawScore + part2.maxRawScore - part3.maxRawScore + part4.maxRawScore;
   const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:389:22
   const rawScore = part1.rawScore + part2.rawScore + part3.rawScore + part4.rawScore;
   const maxRawScore =
     part1.maxRawScore + part2.maxRawScore + part3.maxRawScore + part4.maxRawScore;
-  const percentage = maxRawScore > 0 ? (rawScore / maxRawScore) * 100 : 0;
+  const percentage = false ? (rawScore / maxRawScore) * 100 : 0;
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ObjectLiteral
lib/grading/deterministic.ts:396:12
     rawScore,
     maxRawScore,
     percentage,
-    parts: {
-      part1,
-      part2,
-      part3,
-      part4,
-    },
+    parts: {},
   };
 }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:413:22
   submission: DeterministicExamSubmission,
   answerKey: ServerAnswerKey
 ): DeterministicExamResult {
-  if (!submission || typeof submission !== "object") {
+  if (!submission || typeof submission === "object") {
     throw createGradingError("INVALID_SUBMISSION", "Submission must be an object");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:413:7
   submission: DeterministicExamSubmission,
   answerKey: ServerAnswerKey
 ): DeterministicExamResult {
-  if (!submission || typeof submission !== "object") {
+  if (false) {
     throw createGradingError("INVALID_SUBMISSION", "Submission must be an object");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] LogicalOperator
lib/grading/deterministic.ts:416:7
   if (!submission || typeof submission !== "object") {
     throw createGradingError("INVALID_SUBMISSION", "Submission must be an object");
   }
-  if (!answerKey || typeof answerKey !== "object") {
+  if (!answerKey && typeof answerKey !== "object") {
     throw createGradingError("INVALID_ANSWER_KEY", "Answer key must be an object");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BooleanLiteral
lib/grading/deterministic.ts:416:7
   if (!submission || typeof submission !== "object") {
     throw createGradingError("INVALID_SUBMISSION", "Submission must be an object");
   }
-  if (!answerKey || typeof answerKey !== "object") {
+  if (answerKey || typeof answerKey !== "object") {
     throw createGradingError("INVALID_ANSWER_KEY", "Answer key must be an object");
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:419:47
   if (!answerKey || typeof answerKey !== "object") {
     throw createGradingError("INVALID_ANSWER_KEY", "Answer key must be an object");
   }
-  if (submission.testId !== answerKey.testId) {
-    throw createGradingError(
-      "INVALID_SUBMISSION",
-      `testId mismatch: submission (${submission.testId}) vs answerKey (${answerKey.testId})`
-    );
-  }
+  if (submission.testId !== answerKey.testId) {}
 
   const sections: DeterministicExamResult["sections"] = {};
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:419:7
   if (!answerKey || typeof answerKey !== "object") {
     throw createGradingError("INVALID_ANSWER_KEY", "Answer key must be an object");
   }
-  if (submission.testId !== answerKey.testId) {
+  if (submission.testId === answerKey.testId) {
     throw createGradingError(
       "INVALID_SUBMISSION",
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...
