[Killed] BlockStatement
lib/grading/deterministic.ts:431:68
   let totalMaxRawScore = 0;
 
   // Grade Grammar & Vocabulary if provided
-  if (submission.grammarVocabulary || answerKey.grammarVocabulary) {
-    const gvResult = gradeGrammarVocabularySection(
-      submission.grammarVocabulary,
-      answerKey.grammarVocabulary
-    );
-    sections.grammarVocabulary = gvResult;
-    totalRawScore += gvResult.rawScore;
-    totalMaxRawScore += gvResult.maxRawScore;
-  }
+  if (submission.grammarVocabulary || answerKey.grammarVocabulary) {}
 
   // Grade Reading if provided
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:431:7
   let totalMaxRawScore = 0;
 
   // Grade Grammar & Vocabulary if provided
-  if (submission.grammarVocabulary || answerKey.grammarVocabulary) {
+  if (false) {
     const gvResult = gradeGrammarVocabularySection(
       submission.grammarVocabulary,
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] AssignmentOperator
lib/grading/deterministic.ts:437:5
       answerKey.grammarVocabulary
     );
     sections.grammarVocabulary = gvResult;
-    totalRawScore += gvResult.rawScore;
+    totalRawScore -= gvResult.rawScore;
     totalMaxRawScore += gvResult.maxRawScore;
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] AssignmentOperator
lib/grading/deterministic.ts:438:5
     );
     sections.grammarVocabulary = gvResult;
     totalRawScore += gvResult.rawScore;
-    totalMaxRawScore += gvResult.maxRawScore;
+    totalMaxRawScore -= gvResult.maxRawScore;
   }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:442:7
   }
 
   // Grade Reading if provided
-  if (submission.reading || answerKey.reading) {
+  if (false) {
     const readingResult = gradeReadingSection(submission.reading, answerKey.reading);
     sections.reading = readingResult;
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:442:48
   }
 
   // Grade Reading if provided
-  if (submission.reading || answerKey.reading) {
-    const readingResult = gradeReadingSection(submission.reading, answerKey.reading);
-    sections.reading = readingResult;
-    totalRawScore += readingResult.rawScore;
-    totalMaxRawScore += readingResult.maxRawScore;
-  }
+  if (submission.reading || answerKey.reading) {}
 
   // Grade Listening if provided
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] AssignmentOperator
lib/grading/deterministic.ts:445:5
   if (submission.reading || answerKey.reading) {
     const readingResult = gradeReadingSection(submission.reading, answerKey.reading);
     sections.reading = readingResult;
-    totalRawScore += readingResult.rawScore;
+    totalRawScore -= readingResult.rawScore;
     totalMaxRawScore += readingResult.maxRawScore;
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] AssignmentOperator
lib/grading/deterministic.ts:446:5
     const readingResult = gradeReadingSection(submission.reading, answerKey.reading);
     sections.reading = readingResult;
     totalRawScore += readingResult.rawScore;
-    totalMaxRawScore += readingResult.maxRawScore;
+    totalMaxRawScore -= readingResult.maxRawScore;
   }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:450:7
   }
 
   // Grade Listening if provided
-  if (submission.listening || answerKey.listening) {
+  if (false) {
     const listeningResult = gradeListeningSection(submission.listening, answerKey.listening);
     sections.listening = listeningResult;
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/deterministic.ts:450:52
   }
 
   // Grade Listening if provided
-  if (submission.listening || answerKey.listening) {
-    const listeningResult = gradeListeningSection(submission.listening, answerKey.listening);
-    sections.listening = listeningResult;
-    totalRawScore += listeningResult.rawScore;
-    totalMaxRawScore += listeningResult.maxRawScore;
-  }
+  if (submission.listening || answerKey.listening) {}
 
   const totalPercentage =
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] AssignmentOperator
lib/grading/deterministic.ts:453:5
   if (submission.listening || answerKey.listening) {
     const listeningResult = gradeListeningSection(submission.listening, answerKey.listening);
     sections.listening = listeningResult;
-    totalRawScore += listeningResult.rawScore;
+    totalRawScore -= listeningResult.rawScore;
     totalMaxRawScore += listeningResult.maxRawScore;
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] AssignmentOperator
lib/grading/deterministic.ts:454:5
     const listeningResult = gradeListeningSection(submission.listening, answerKey.listening);
     sections.listening = listeningResult;
     totalRawScore += listeningResult.rawScore;
-    totalMaxRawScore += listeningResult.maxRawScore;
+    totalMaxRawScore -= listeningResult.maxRawScore;
   }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/deterministic.ts:458:5
   }
 
   const totalPercentage =
-    totalMaxRawScore > 0 ? (totalRawScore / totalMaxRawScore) * 100 : 0;
+    false ? (totalRawScore / totalMaxRawScore) * 100 : 0;
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/deterministic.ts:458:5
   }
 
   const totalPercentage =
-    totalMaxRawScore > 0 ? (totalRawScore / totalMaxRawScore) * 100 : 0;
+    totalMaxRawScore <= 0 ? (totalRawScore / totalMaxRawScore) * 100 : 0;
 
   return {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ObjectLiteral
lib/grading/deterministic.ts:460:10
   const totalPercentage =
     totalMaxRawScore > 0 ? (totalRawScore / totalMaxRawScore) * 100 : 0;
 
-  return {
-    testId: submission.testId,
-    totalRawScore,
-    totalMaxRawScore,
-    totalPercentage,
-    sections,
-    disclaimer: "PRACTICE ESTIMATE — NOT AN OFFICIAL BRITISH COUNCIL SCORE",
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...
