[Killed] BlockStatement
lib/grading/normalize.ts:9:57
  * - Safely canonicalizes string tokens.
  */
 
-export function normalizeString(value: unknown): string {
-  if (typeof value !== "string") {
-    return "";
-  }
-  return value.trim();
-}
+export function normalizeString(value: unknown): string {}
 
 export function normalizeStringArray(arr: unknown): string[] {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/normalize.ts:10:7
  */
 
 export function normalizeString(value: unknown): string {
-  if (typeof value !== "string") {
+  if (typeof value === "string") {
     return "";
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/normalize.ts:10:7
  */
 
 export function normalizeString(value: unknown): string {
-  if (typeof value !== "string") {
+  if (false) {
     return "";
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] MethodExpression
lib/grading/normalize.ts:13:10
   if (typeof value !== "string") {
     return "";
   }
-  return value.trim();
+  return value;
 }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/normalize.ts:16:62
   return value.trim();
 }
 
-export function normalizeStringArray(arr: unknown): string[] {
-  if (!Array.isArray(arr)) {
-    return [];
-  }
-  return arr
-    .filter((item): item is string => typeof item === "string")
-    .map((item) => item.trim());
-}
+export function normalizeStringArray(arr: unknown): string[] {}
 
 export function normalizeId(id: unknown): string {
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/normalize.ts:17:28
 }
 
 export function normalizeStringArray(arr: unknown): string[] {
-  if (!Array.isArray(arr)) {
-    return [];
-  }
+  if (!Array.isArray(arr)) {}
   return arr
     .filter((item): item is string => typeof item === "string")
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/normalize.ts:17:7
 }
 
 export function normalizeStringArray(arr: unknown): string[] {
-  if (!Array.isArray(arr)) {
+  if (true) {
     return [];
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] MethodExpression
lib/grading/normalize.ts:20:10
   if (!Array.isArray(arr)) {
     return [];
   }
-  return arr
-    .filter((item): item is string => typeof item === "string")
+  return arr
     .map((item) => item.trim());
 }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/normalize.ts:21:39
     return [];
   }
   return arr
-    .filter((item): item is string => typeof item === "string")
+    .filter((item): item is string => typeof item !== "string")
     .map((item) => item.trim());
 }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/normalize.ts:21:39
     return [];
   }
   return arr
-    .filter((item): item is string => typeof item === "string")
+    .filter((item): item is string => true)
     .map((item) => item.trim());
 }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] MethodExpression
lib/grading/normalize.ts:22:20
   }
   return arr
     .filter((item): item is string => typeof item === "string")
-    .map((item) => item.trim());
+    .map((item) => item);
 }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ArrowFunction
lib/grading/normalize.ts:22:10
   }
   return arr
     .filter((item): item is string => typeof item === "string")
-    .map((item) => item.trim());
+    .map(() => undefined);
 }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] BlockStatement
lib/grading/normalize.ts:25:50
     .map((item) => item.trim());
 }
 
-export function normalizeId(id: unknown): string {
-  if (typeof id !== "string") {
-    return "";
-  }
-  return id.trim();
-}
+export function normalizeId(id: unknown): string {}
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/normalize.ts:26:7
 }
 
 export function normalizeId(id: unknown): string {
-  if (typeof id !== "string") {
+  if (false) {
     return "";
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/normalize.ts:26:7
 }
 
 export function normalizeId(id: unknown): string {
-  if (typeof id !== "string") {
+  if (true) {
     return "";
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] StringLiteral
lib/grading/normalize.ts:27:12
 
 export function normalizeId(id: unknown): string {
   if (typeof id !== "string") {
-    return "";
+    return "Stryker was here!";
   }
   return id.trim();
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] MethodExpression
lib/grading/normalize.ts:29:10
   if (typeof id !== "string") {
     return "";
   }
-  return id.trim();
+  return id;
 }
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...
