[Killed] BlockStatement
lib/grading/word-counter.ts:8:51
  * and multiple whitespace/newline delimiters.
  */
 
-export function countWords(text: unknown): number {
-  if (typeof text !== "string") {
-    return 0;
-  }
-
-  const trimmed = text.trim();
-  if (trimmed.length === 0) {
-    return 0;
-  }
-
-  // Matches sequences of alphanumeric characters, including apostrophes and hyphens inside words
-  const words = trimmed.match(/[\p{L}\p{N}]+(?:['’\-][\p{L}\p{N}]+)*/gu);
-  return words ? words.length : 0;
-}
+export function countWords(text: unknown): number {}
 
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE
==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/word-counter.ts:9:7
  */
 
 export function countWords(text: unknown): number {
-  if (typeof text !== "string") {
+  if (typeof text === "string") {
     return 0;
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] ConditionalExpression
lib/grading/word-counter.ts:9:7
  */
 
 export function countWords(text: unknown): number {
-  if (typeof text !== "string") {
+  if (true) {
     return 0;
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Survived] MethodExpression
lib/grading/word-counter.ts:13:19
     return 0;
   }
 
-  const trimmed = text.trim();
+  const trimmed = text;
   if (trimmed.length === 0) {
     return 0;

[Killed] ConditionalExpression
lib/grading/word-counter.ts:14:7
   }
 
   const trimmed = text.trim();
-  if (trimmed.length === 0) {
+  if (true) {
     return 0;
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] EqualityOperator
lib/grading/word-counter.ts:14:7
   }
 
   const trimmed = text.trim();
-  if (trimmed.length === 0) {
+  if (trimmed.length !== 0) {
     return 0;
   }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...

[Killed] Regex
lib/grading/word-counter.ts:19:31
   }
 
   // Matches sequences of alphanumeric characters, including apostrophes and hyphens inside words
-  const words = trimmed.match(/[\p{L}\p{N}]+(?:['’\-][\p{L}\p{N}]+)*/gu);
+  const words = trimmed.match(/[\p{L}\p{N}]+(?:['’\-][\p{L}\p{N}]+)/gu);
   return words ? words.length : 0;
 }
killedBy: All tests
statusReason: ==================================================

APTIS B2 PRACTICE WEB APP — MASTER RED-TEAM QA SUITE

==================================================


▶ [TEST 1] Running Schema & Dataset Validation...
